Revit 2024 API
InitialWattageIntensity Members
The InitialWattageIntensity type exposes the following members.
Constructors
Name | Description
InitialWattageIntensity(InitialWattageIntensity)
 Creates a copy of the given initial wattage intensity object
InitialWattageIntensity(Double, Double)
 Creates an initial wattage intensity object with the given values.
Methods
Name | Description
Clone
 Creates a copy of the InitialIntensity derived object.
 (Inherited from InitialIntensity.)
Dispose |  (Inherited from InitialIntensity.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Efficacy
 The efficacy value.
InitialIntensityValue
 The calculated initial intensity value.
 (Inherited from InitialIntensity.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from InitialIntensity.)
Wattage
 The wattage value.
See Also
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace